# ExtendBelowBaseGreaterThanLandingBaseElevation Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..StairRampFailures..::..ExtendBelowBaseGreaterThanLandingBaseElevation Property
BuiltInFailures..::..StairRampFailures Class See Also
---
Extend Below Base needs to be less than Landing Base Elevation.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ExtendBelowBaseGreaterThanLandingBaseElevation { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ExtendBelowBaseGreaterThanLandingBaseElevation As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ExtendBelowBaseGreaterThanLandingBaseElevation {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..StairRampFailures Class
Autodesk.Revit.DB Namespace